Repository: nataliasannchez/06286885L
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: But, true to its mission as a modern franchise film, Scream VI’s focus is inward rather than at the wider world of cinema.
es: Pero, fiel a su misión como película de franquicia moderna, Scream VI se centra en el interior y no en el mundo más amplio del cine.

source: But, ultimately, showrunner Patrick Somerville and company have a far braver statement to make: That even after everything we now have is gone forever, there will still be a future.
es: Pero, en última instancia, el showrunner Patrick Somerville y compañía tienen una declaración mucho más valiente que hacer: Que incluso después de que todo lo que ahora tenemos se haya ido para siempre, seguirá habiendo un futuro.

source: Buy Tickets Here
es: Comprar las entradas aquí

source: By Dylan Roth • 03/08/23 9:58am
es: Por Dylan Roth • 23/08/03 09:58

source: By Dylan Roth • 03/10/23 8:09am
es: Por Dylan Roth • 03/10/23 8:09am

source: Carrie Coon plays her fellow female journalist in arms, and together they work to unmask the identity of the strangler — and the bed of complicity and corruption that allowed him to do so much damage.
es: Carrie Coon interpreta a su compañera periodista de armas tomar, y juntas trabajan para desenmascarar la identidad del estrangulador - y el lecho de complicidad y corrupción que le permitió hacer tanto daño.

source: Central protagonist Sam Carpenter (Melissa Barrera) is haunted by visions of her serial-killer father urging her to become Scream’s new villain.
es: La protagonista central Sam Carpenter (Melissa Barrera) está atormentada por visiones de su padre asesino en serie instándola a convertirse en la nueva villana de Scream.

source: Class of ’07
es: Curso del 2007

source: Daniel Pemberton never expected to hear his music performed live by a concert orchestra.
es: Daniel Pemberton nunca se había imaginado escuchar su música en directo en un concierto de orquesta.

source: Discouraged by her male co-workers and threatened by the killer’s penchant for targeting women, she faces dangers to her career as well as her life.
es: Desalentada por sus compañeros de trabajo y amenazada por la afición del asesino a atacar a las mujeres, se enfrenta a peligros para su carrera y su vida.

source: Do you have any plans to bring Mr. Swallow on tour in America?
es: ¿Está planeando tomar M. Swallow de gira por los Estados Unidos?

source: Does it feel true to the character?
es: ¿Es fiel al personaje?

source: Does it fly in the face of the classic Hollywood ending?
es: ¿Va en contra del clásico final de Hollywood?

source: Elvis meets Archer in this new adult animated comedy.
es: Elvis conoce a Archer en esta nueva comedia de animación para adultos.

source: Ever since then, I always wanted to do a score where I record the orchestra and then scratch it back in.”
es: Desde entonces, siempre quise hacer una partitura en la que grabara la orquesta y luego la volviera a rascar."

source: Extrapolations
es: Un futuro desafiante

source: Film composer Daniel Pemberton explains the challenges of bringing the sounds of "Spider-Man: Into the Spider-Verse" from the screen to the stage in Brooklyn, the home of the film’s hero Miles Morales.
es: El director Daniel Pemberton explica lo complicado que es llevar la música de "Spider-Man: Into the Spider-Verse" desde la gran pantalla hasta Brooklyn, la cuna de la película del héroe Miles Morales.

source: For Pemberton, there’s also the wish that the Spider-Man: Into the Spider-Verse concert tour will bring together a variety of audiences just as the film did.
es: Para Pemberton, también existe el deseo de que la gira de conciertos de Spider-Man: Into the Spider-Verse reúna a una gran variedad de público al igual que lo hizo la película.

source: For instance, Scream VI’s plot gets wobbly in the third act, a problem so common amongst modern blockbusters that this film could probably have gotten away with it if they’d pointed it out themselves.
es: Por ejemplo, la trama de Scream VIse tambalea en el tercer acto, un problema tan común en los éxitos de taquillas modernos que esta película podría haberse evitado si ellos mismos lo hubieran señalado.

source: For most sequels, this would be an unequivocally positive development, but in the case of Scream, it means this chapter is missing a bit of what makes the series special.
es: Para la mayoría de las secuelas, esto sería un desarrollo inequívocamente positivo, pero en el caso de Scream, significa que a este capítulo le falta un poco de lo que hace que la serie sea especial.

source: For people in Brooklyn, this is their movie, and I want to hear their reaction.”
es: Para la gente de Brooklyn, ésta es su película, y quiero oír su reacción".

source: For the first time in the series, it feels as if exploring the characters is a higher priority than commenting on the state of the genre.
es: Por primera vez en la serie, parece que explorar a los personajes es una prioridad más alta que comentar sobre el estado del género.

source: For the first time, Scream seems at risk of becoming just another horror perennial, one that fans go see because there’s a new installment, not because it has anything new to say.
es: Por primera vez, Scream parece estar en peligro de convertirse en otra película de terror de larga duración donde los fanáticos la verán porque es una serie nueva no porque tenga algo nuevo que decir.

source: For the tour’s world premiere, which will take place at the King’s Theatre in Brooklyn on Friday, March 17th, Pemberton expects to play these parts himself, as well as piano.
es: Para el estreno mundial de la gira, que tendrá lugar en el King's Theatre de Brooklyn el viernes 17 de marzo, Pemberton espera tocar él mismo estos papeles, además del piano.

source: Former BFFs, bullies, and good girls must band together to survive with their rapidly dwindling resources, but some get a bit too drunk on the power of reliving their high school days.
es: Las antiguas mejores amigas, las matonas y las chicas buenas deben unirse para sobrevivir con sus recursos cada vez más escasos, pero algunas se emborrachan demasiado con el poder de revivir sus días de instituto.

source: Forty minutes a day that took to put on and a few minutes to take off.
es: Cuarenta minutos al día que tardaba en ponérsela y unos minutos en quitársela.

source: From an animated Elvis to a charged take on the BeyHive, this week is full of fascinating new genre forays.
es: Desde un Elvis animado hasta una cargada versión de BeyHive, esta semana está repleta de fascinantes incursiones en nuevos géneros.

source: Ghostface in ‘Scream VI.’ Philippe Bossé
es: Ghostface en 'Scream VI'. Philippe Bossé

source: He feels like he has a huge point to prove.
es: siente que tiene mucho que demostrar.

source: Her twin brother Chad (Mason Gooding), is simply adorable, a sweet, handsome non-toxic jock who has chemistry with everyone.
es: Su hermano gemelo Chad (Mason Gooding) es simplemente adorable, un atleta no tóxico dulce y guapo que tiene química con todos.

source: Her younger sister Tara (Jenna Ortega) is her reason for living, but Tara wants her own life, something the audience knows she can never have.
es: Su hermana menor Tara (Jenna Ortega) es su razón de vivir, pero Tara quiere su propia vida, algo que el público sabe que nunca podrá tener.

source: He’s got a lot of soul searching to do still.
es: Todavía tiene mucho que buscar en su interior.

source: He’s riddled with insecurities.
es: Está lleno de inseguiridades .

source: He’s still new to West Ham.
es: Todavía es nuevo en el West Ham..

source: He’s still suffering from the guilt, shame, regret, the anger of leaving Richmond the way he did.
es: Todavía sufre de culpa, vergüenza, tristeza e ira por dejar a Richmond de esta manera. .

source: He’s such a sweetheart.
es: Ese es el encanto.

source: He’s suddenly in this completely different environment.
es: De repente estás en un entorno completamente diferente.

source: His new job means he’s not at Richmond anymore.
es: Su nuevo trabajo significa que ya no está en Richmond.

source: Hot off the press from this year’s South by Southwest Film Festival comes Swarm, a buzzy new thriller series from Donald Glover.
es: Recién estrenada en el Festival de Cine South by Southwest de este año, llega Enjambre, una nueva serie de suspense de Donald Glover.

source: How did directors Phil Lord and Chris Miller convince Pemberton, who habitually avoids anything cookie-cutter, to come on board?
es: ¿Cómo el director Phil Lord y Chris Miller convencieron a Pemberton, quien habitualmente evita cualquier cosa del montón, para que se animara a hacer la película?

source: I did rely on a lot of coaching through it from Jason and our great team of directors.
es: He confiado mucho en la ayuda de Jason y de nuestro excelente equipo de directores.

source: I mean, it was excruciating.
es: Quiero decir, era insoportable.

source: I mean, it’s been an absolutely incredible calling card.
es: Esta es una tarjeta de presentación increíble.

source: I met the directors to have a chat and I think they were chatting to maybe a couple of other people, but I didn’t have to kind of cast for it in the usual way.
es: Me reuní y conversé con los directores, y creo que ellos conversaron con algunas otras personas, pero no tuve que hacer el casting como de costumbre.

source: I think we see him as a troubled soul rather than as an evil figure.
es: Creo que lo vemos como un alma en pena y no como un mal tipo.

source: I want this concert to bring all of these different worlds together, and create something new and fresh that hopefully excites people and makes them want to do things.”
es: Quiero que este concierto reúna todos estos mundos diferentes y cree algo nuevo y fresco que, espero, emocione a la gente y le dé ganas de hacer cosas."

source: I was suddenly without them and that did feel weird.
es: De repente me encontraba sin ellos y eso me resultaba extraño.

source: If anything, all those things, like the mild celebrity status and social media interaction, all they’re doing is increasing his downfall.
es: En todo caso, todas estas cosas como el nivel de popularidad y las actividades en las redes sociales solo aumentarán su participación.

source: If the bleak finale of 'The Last of Us' has left an empty space in your life, you may be ready for HBO's most daring post-apocalyptic drama, 'Station Eleven,' which has the courage to be optimistic.
es: Si el final desolador de "The Last of Us" ha dejado un hueco en tu vida, probablemente estés listo para el drama posapocalíptico más intrépido de HBO, "Estación Once", que podría ser optimista.

source: If you’re into Yellowjackets but wished it had a little more comedy and a little less cannibalism, then Class of ’07 is perfect for you.
es: Si te gusta Yellowjackets pero desearías que tuviera un poco más de comedia y un poco menos de canibalismo, entonces Curso del 2007 es perfecta para ti.

source: In the absence of modern structure and convenience, humanity has become more animalistic, cruel, and territorial.
es: Con la ausencia de una estructura moderna y cómoda, la humanidad se ha vuelto brutal, cruel y territorial.

source: In the early 1950s, a soon-to-be-divorced Carol Aird catches the eye and the heart of Therese (Rooney Mara), a naïve photographer who has really considered her real desires.
es: A principios de los años 50, una Carol Aird a punto de divorciarse atrae la mirada y el corazón de Therese (Rooney Mara), una ingenua fotógrafa que realmente ha considerado sus verdaderos deseos.

source: Including a new series from Donald Glover, one of Cate Blanchett's best performances, and a new Keira Knightley period piece.
es: Incluye una nueva serie de Donald Glover, una de las mejores interpretaciones de Cate Blanchett y una nueva obra de época de Keira Knightley.

source: Indeed, before the film’s release, few outside the production suspected that Spider-Verse, yet another goddamn Spider-Man movie, was going to be an artistically groundbreaking work of cinema that would delight critics and push the medium of animation to a new level.
es: De hecho, antes de que se emitiera la película, algunos fuera de la producción sospechaban queSpider-Verse u otra maldita película de Spider-Man,iba a ser una obra artisticamente revolcionaria en el cine y que fuera a deleitar críticas y propulsar la técnica de animación a un nuevo nivel.

source: Instead, Agent Elvis sees the singer join a top-secret spy organization, working against dastardly villains dead-set on world domination.
es: En su lugar, Agente Elvis el cantante se une a una organización de espionaje de alto secreto, trabajando contra villanos temibles decididos a dominar el mundo.

source: Instead, Pemberton and DJ Blakey, a well-heeled London turntablist, employed modern Serato DJ software to virtually spin and scratch the uncompressed orchestral recording.
es: En su lugar, Pemberton y DJ Blakey, un adinerado tornamesista londinense, emplearon el moderno software Serato DJ para hacer girar y rascar virtualmente la grabación orquestal sin comprimir.

source: It combines her struggles with addiction and her undying passion for her cause as she helps stage major protests at some of the world’s biggest artistic landmarks.
es: Combina sus luchas contra la adicción y su pasión inquebrantable por su causa mientras ayuda a organizar grandes protestas en algunos de los mayores hitos artísticos del mundo.

source: It looks at the profound ways that acts of cruelty or kindness can reverberate across generations.
es: Analiza las profundas formas en que los actos de crueldad o bondad pueden reverberar a través de las generaciones.

source: It started off as excruciating.
es: Al principio era insoportable .

source: It still functions as a bloody, thrilling mystery, but it doesn’t operate on the higher level that Scream fans have come to expect.
es: Todavía funciona como un misterio sangriento y emocionante, pero no opera en el nivel más alto que los fans de Scream esperan.< /s11>

source: It was Pemberton who insisted that the concert tour, which is planned to hit cities around the US, UK, Europe, and Japan, should begin in Brooklyn, the home of the film’s hero Miles Morales.
es: Fue Pemberton quien insistió en que la gira de conciertos, que está previsto que recorra ciudades de Estados Unidos, Reino Unido, Europa y Japón, comenzara en Brooklyn, el hogar del héroe de la película, Miles Morales.

source: It was less familiar to me.
es: Me resultaba menos familiar.

source: It works as a slashy thriller, but not so much on the meta level 'Scream' fans have come to expect.
es: Funciona como un thriller slashy, pero no tanto en el nivel meta que los fanáticos de 'Scream' esperan.

source: Its depictions of its global pandemic (shot mostly before the COVID-19 outbreak) may tug at still-healing wounds or recall recent memories of loss and despair.
es: Sus descripciones de la pandemia global (rodadas en su mayor parte antes del brote de COVID-19) pueden hurgar en heridas aún cicatrizadas o evocar recuerdos recientes de pérdida y desesperación.

source: It’s a silly take on an American icon and a delightfully novel dip into new genres for Netflix.
es: Es una versión absurda de un icono americano y una deliciosa y novedosa incursión en nuevos géneros para Netflix.

source: It’s a testament to how well these performers work together that absent original Scream star Neve Campbell isn’t missed, and that Courteney Cox’s appearances in the film don’t feel that necessary.
es: Es un testimonio de lo bien que estos artistas trabajan juntos que la estrella original de Scream Neve Campbell no se pierde, y que las apariciones de Courteney Cox en el la película no se siente tan necesaria.

source: It’s all in the writing—I can’t really take credit for that.
es: Todo está en el guión, no puedo atribuirme el mérito.

source: It’s also possible that Scream VI’s recursiveness and relative aimlessness is a deliberate statement on the nature of franchise filmmaking, where the only point of most installments is to keep the wheels turning, but if so, it’s done without the usual wink towards the camera.
es: también es posible que la presencia recurrente de Scream VI y su relativa falta de rumbo sean declaraciones deliberadas sobre la naturaleza de las franquicias cinematográficas, la mayoría de las cuales tienen el único propósito de seguir girand pero si ese es el caso, se acabó, no parpadeó a la cámara como de costumbre.

source: It’s difficult to pull off a short wig.
es: Es difícil llevar una peluca corta.

source: It’s not like I’m suddenly super famous or anything like that.
es: No es porque de repente me volví muy famoso o algo por el estilo.

source: It’s not uncharted territory, it’s simply not as ripe for parody.
es: No es un territorio desconocido, simplemente no está tan maduro para la parodia.

source: It’s such a well-loved show and I’m so so proud of it and grateful for being a part of it.
es: Esta es una serie querida de la que estoy muy orgulloso y agradecido de ser parte.

source: It’s through her that we experience the exhaustion of being trapped in the franchise meat grinder.
es: Es a través de ella que experimentamos el agotamiento de estar atrapados en la picadora de carne de la franquicia.

source: I’m about to do that soon as a U.K. tour [“The Very Best and Worst of Mr. Swallow”], which kicks off in April.
es: Estoy a punto de hacer una gira por el Reino Unido ["The Very Best and Worst of Mr. Swallow"], que comienza en abril.

source: Just have that in the back of your mind.” There were often times when we were looking forward to what we hadn’t filmed yet, but we were going to film.
es: Tenlo presente". A menudo teníamos ganas de ver lo que aún no habíamos rodado, pero que íbamos a rodar.

source: Keira Knightley loves a period piece, but Boston Strangler sees the actress take on recent history.
es: El estrangulador de Boston A Keira Knightley le encantan las obras de época, pero El estrangulador de Bostonlleva a la actriz a la historia reciente.

source: Knightley plays Loretta McLaughlin, the journalist who broke the story of the Boston Strangler.
es: Knightley interpreta a Loretta McLaughlin, la periodista que dio a conocer la historia del Estrangulador de Boston.

source: Less charitably, The Last of Us is yet another bleak representation of humanity’s selfish nature, the very thing that makes us unable to bind together to save our ecosystem before its impending collapse in the century ahead.
es: Menos generosamente, The Last of Us es otra representación desoladora de la naturaleza egoísta de la humanidad, aquello que nos hace incapaces de unirnos para salvar nuestro ecosistema antes de su inminente colapso en el próximo siglo.

source: Like The Last of Us, it takes an extended look at an America decades after most of its people are dead and things like government, electricity, and the Internet are distant memories.
es: Al igual que The Last of Us, echa un amplio vistazo a unos Estados Unidos décadas después de que la mayoría de sus habitantes hayan muerto y cosas como el gobierno, la electricidad e Internet sean recuerdos lejanos.

source: Like last week’s Creed III, the next installment in this franchise should get by just fine without any of the legacy cast.
es: Al igual que Creed III de la semana pasada, la próxima entrega de esta franquicia debería funcionar bien sin ninguno de los personajes heredados.

source: Make no mistake, Station Eleven is not cozy viewing.
es: No nos equivoquemos, Estación Once no es una serie agradable.

source: Matched together by Sony, which owns both the studio that produced Into the Spider-Verse and a majority stake in Senbla, Pemberton and Rosenblatt conceived an ambitious touring concert series that would allow Pemberton to realize his music live on stage for the first time, and to push the boundaries of orchestral performance in the process.
es: Unidos por Sony, propietaria del estudio que produjo Into the Spider-Verse y de una participación mayoritaria en Senbla, Pemberton y Rosenblatt concibieron una ambiciosa serie de conciertos itinerantes que permitiría a Pemberton realizar su música en directo por primera vez y, de paso, ampliar los límites de la interpretación orquestal.

source: Matthew McConaughey voices The King, but it’s hardly a role that demands Austin Butler-level realism.
es: Matthew McConaughey pone voz al Rey, pero no es un papel que exija un realismo al nivel de Austin Butler.

source: Mindy Meeks-Martin (Jasmin Savoy Brown) is the gang’s resident horror-movie supergenius, but beyond her role of explaining the patterns of the genre to the gang/audience, she’s also effortlessly funny.
es: Mindy Meeks-Martin (Jasmin Savoy Brown) es la súper genio de las películas de terror residente de la pandilla, pero más allá de su papel de explicar los patrones del género a la pandilla/audiencia, también es divertida sin esfuerzo.

source: Nate has now gone completely grey.
es: Nate se ha vuelto completamente gris.

source: Naturally, the legacy of the Ghostface murders has followed them East, and soon they’re on the run for their lives yet again.
es: Naturalmente, el legado de los asesinatos de Ghostface los ha seguido hacia el este, y pronto estarán huyendo por sus vidas una vez más.

source: Not So Much
es: No tanto

source: Now, Pemberton is tasked with finding a way to reproduce this effect in a live performance, something that concert producer Ollie Rosenblatt says has never been attempted before on this sort of stage.
es: Ahora, Pemberton tiene la tarea de encontrar la forma de reproducir este efecto en una actuación en directo, algo que, según el productor de conciertos Ollie Rosenblatt, nunca se ha intentado antes en este tipo de escenario.

source: Of Course!
es: Por supesto

source: Oh God, that wig.
es: Oh Dios, esa Peluca.

source: On a scale of a little bit bad to complete evil villain, where do we find Nate this season?
es: En una escala que va de un poco malo a un completo villano malvado, ¿dónde encontramos a Nate esta temporada?

source: One of the technical challenges of recording the score was incorporating scratch turntablism into an orchestral recording, a process that might once have required pressing the studio orchestra session onto vinyl and then having a DJ fiddle with it live to tape.
es: Uno de los retos técnicos de la grabación de la partitura fue incorporar el scratch turntablism a una grabación orquestal, un proceso que en su día podría haber requerido prensar la sesión de orquesta de estudio en vinilo y luego hacer que un DJ jugueteara con ella en directo para grabarla.

source: Only time and deeper viewing will reveal whether the storytellers are playing a long game or have simply tripped over themselves in the rush to produce a follow-up to a hit, as countless filmmakers have done before them.
es: solo el tiempo y una observación más cercana dirán si los narradores están jugando el juego largo o simplemente se enamoraron de él en su prisa por hacer una secuela de gran éxito como innumerables cineastas antes.

source: Pemberton and Rosenblatt encourage audiences to vocalize their enthusiasm throughout the show.
es: Pemberton y Rosenblatt animan al público a vocalizar su entusiasmo durante todo el espectáculo.

source: Pemberton’s first response was, he says, “There’s no way that’s going to be in the movie.” But assured that it would be, he was in.
es: La primera respuesta de Pemberton fue, "De ninguna manera voy a participar en la película."Pero afirmó que sí que estará.

source: Play
es: Reproducir
